[
  {
    "id": 1,
    "title": "Slovakia claims Russians sabotaged its fighter jets",
    "pubDate": "2023-04-07 16:28:14",
    "link": "https://www.rt.com/news/574373-slovakia-mig-jets-sabotage/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574373-slovakia-mig-jets-sabotage/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > Russian engineers may have intentionally sabotaged MiG-29 fighter jets that Slovakia gave to Ukraine, claims Defense Minister Jaroslav Nad’ <br><a href=\"https://www.rt.com/news/574373-slovakia-mig-jets-sabotage/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>Defense Minister Jaroslav Nad’ has suggested Russian technicians may have damaged jets that were later gifted to Ukraine</strong></p>\n            \n                        \n            <p>Soviet-made MiG-29 fighter jets belonging to the Slovak army may have been intentionally sabotaged by Russian engineers who worked on them before they were given to Ukraine, Slovakian Defense Minister Jaroslav Nad’ claimed on Friday.</p>\n<p>As reported by Euractiv, Nad’s statement came after former Slovakian prime minister Robert Fico criticized the government in Bratislava for giving up the valuable aircraft to Kiev.</p>\n<p>Slovakia retired its fleet of MiG-29s last summer as most of the planes were not operational. Last month, the Slovak government announced that it would be giving 10 MiGs with engines and another three without engines to Ukraine’s forces. Four of the jets have already been delivered and are patrolling the skies over Kharkov, according to Ukrainian officials, while the other nine are expected to arrive in the near future.</p>\n<p>However, Nad’ now suggests that the jets may have been intentionally damaged by Russian technicians who had worked on the planes at the Sliac air base in Slovakia until last year.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.03/thumbnail/641474912030274a226524c2.jpg\" alt=\"FILE PHOTO: MIG - 29 fighter jet.\"><figcaption><a href=\"https://www.rt.com/russia/573140-dispose-old-jets-ukraine/\">NATO states using Ukraine to dispose of old weapons – Kremlin</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p><em>“Even the police were investigating it, based on our suspicions. There were parts in the engines of the aircraft that Slovak technicians accessed, and then there were parts that Russian technicians only accessed. The defects appeared only in those parts accessed by Russians,”</em> Naď said. </p>\n<p>He added that while the investigation has failed to prove any ill intent on the part of the engineers, the defense ministry <em>“felt a loss of confidence in the Russian technicians”</em> because mistakes kept appearing<em> “in places only they could get to.”</em></p>\n<p>Slovakia’s former highest-ranking pilot, Lubomir Svoboda, also suggested there was<em> “poor”</em> workmanship on the jets. <em>“We took over an engine from them that was supposed to last 350 hours. And in the end, it only flew 70 hours. What can we make of that?”</em> he said.</p>\n<p>Russia’s embassy in Slovakia, meanwhile, has criticized officials for sending the jets to Ukraine, arguing that the move was <em>“illegal”</em> because it required Moscow’s approval under bilateral agreements. It also warned that such deliveries could lead to<em> “an unpredictable and dangerous escalation of the conflict.” </em></p>\n<p>Kremlin spokesman Dmitry Peskov has stated that the MiG-29s would be destroyed by Russian forces just like any other Western weapons sent to the country. Peskov also said he had the impression that Kiev’s allies were using Ukraine to simply <em>“dispose of old hardware that they do not need anymore.”</em></p>\n",
    "img": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64303c7e85f54072a9182654.jpg",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64303c7e85f54072a9182654.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 2,
    "title": "German religious leader calls out Ukrainian diplomats",
    "pubDate": "2023-04-07 16:07:22",
    "link": "https://www.rt.com/news/574371-german-evangelical-leader-criticizes-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574371-german-evangelical-leader-criticizes-ukraine/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\"> The head of Germany’s Evangelical Church Annette Kurschus has criticized Ukrainian officials who have dismissed calls for peace as “senile” <br><a href=\"https://www.rt.com/news/574371-german-evangelical-leader-criticizes-ukraine/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The council president of the country’s Evangelical Church Annette Kurschus emphasized a need for peace proposals</strong></p>\n            \n                        \n            <p>The head of the Evangelical Church in Germany has rebuked high-profile Ukrainian officials for attacking a recent public appeal by renowned German politicians for work on a peace process.  </p>\n<p>In an interview with newspaper Koelner Stadt-Anzeiger published on Thursday, Annette Kurschus said that she is angered by <em>“this artificial alternative between weapons deliveries and talks.”  </em></p>\n<p>While arms deliveries to Kiev are still necessary, in the clergywoman’s eyes, equally important are <em>“efforts [to bring about] talks”</em> between Ukraine and Russia, she pointed out. </p>\n<p>According to Kurschus,<em> “negotiations on an equal footing don’t come about on their own, they must be brought about.”</em> She went on to state that she disagrees with Ukrainian Ambassador to Germany Alexey Makeev, who characterized calls for a truce as cynical.<em> “I refuse to dismiss the call for negotiations as cynical and naive,”</em> she said.</p>\n<p>Her comments came in response to the harsh remarks made last week by Ukraine’s former envoy Andrey Melnyk and by his successor in office. </p>\n<p>Taking to Twitter last Saturday, Melnyk, who currently serves as Ukraine’s Deputy Foreign Minister, told former historian Peter Brandt and several prominent German social democrats who’d initiated the call for peace negotiations, to <em>“go to hell with your senile idea to reach a quick ceasefire.”</em> The outspoken diplomat added that the <em>“Ukrainians reject this frippery.” </em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642d70bb85f5404c9b5a330e.jpg\" alt=\"An infantryman stands next to a Panther KF51 battle tank at the Rheinmetall plant in Unterlüß, Lower Saxony, Germany, July 14, 2022.\"><figcaption><a href=\"https://www.rt.com/business/574218-german-arms-business-ukraine/\">German arms business booming amid Ukraine crisis – Bloomberg</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Echoing his sentiment, Kiev’s current ambassador Makeev told German news agency DPA on Sunday that the appeal for peace in question is <em>“pure cynicism in the face of the numerous victims of the Russian aggression.”</em> The official went on to claim that the authors were merely trying to obfuscate<em> “Russia’s crimes.” </em></p>\n<p>Titled <em>“Make peace!,”</em> the article was authored by Brandt and signed by a number of heavyweights of German and European politics, including ex-EU Commissioner Günter Verheugen, former Bundestag President Wolfgang Thierse and former SPD leader Andrea Ypsilanti.</p>\n<p>The piece warns the German leadership that the continuation of fighting in Ukraine risks spreading the conflict further afield, with the <em>“shadow of a nuclear war”</em> hanging over Europe. The appeal evokes the policy of détente of the Cold War, arguing that it is as relevant as ever. </p>\n<p>The author and signatories conclude by calling on German Chancellor Olaf Scholz, with whom many of them share a party allegiance, to join forces with the likes of France, Brazil, China, India and Indonesia in a bid to bring about a swift cessation of hostilities in Ukraine.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64303cfa85f5404af46ad5ec.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 3,
    "title": "Moscow reacts to Blinken’s counteroffensive claim",
    "pubDate": "2023-04-07 15:54:04",
    "link": "https://www.rt.com/news/574368-peskov-blinken-us-ukraine/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574368-peskov-blinken-us-ukraine/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > The Russian military uses all available data in planning its actions in Ukraine, Kremlin press secretary Dmitry Peskov has said <br><a href=\"https://www.rt.com/news/574368-peskov-blinken-us-ukraine/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The Russian military is likely to assess the remarks by the US secretary of state, the Kremlin has said</strong></p>\n            \n                        \n            <p>The Russian military will likely scrutinize comments made by US Secretary of State Antony Blinken after he predicted a potential timeframe for a Ukrainian counteroffensive, Kremlin spokesman Dmitry Peskov has said.  </p>\n<p>In an interview on Friday with Ouest-France and German media group Funke, Blinken stated that the US and its allies should <em>“do everything... to help Ukraine reconquer the territories taken by Russia, including through a counteroffensive, expected in the coming weeks.”</em> </p>\n<p>In response, Peskov noted that Russia uses a range of information in planning its operations in the conflict with Ukraine, and that Blinken’s remarks appeared to be<em> “a statement that is a subject for examination by our military.”</em></p>\n<p><em>“They thoroughly track all the relevant information and take it into account when planning the continuation of the special military operation,”</em> the presidential spokesman explained. </p>\n<p>Kiev and its Western backers have increasingly talked up a major counteroffensive by Ukrainian forces, supposedly set to take place sometime during the spring and involving tanks and other hardware provided by the West, as well as Ukrainian troops trained abroad. </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642f8e3a85f5404c1d5692b0.jpg\" alt=\"FILE PHOTO: Ukrainian soldiers fire a self-propelled howitzer at the front line near the city of Artyomovsk, March 5, 2023.\"><figcaption><a href=\"https://www.rt.com/news/574334-leak-documents-ukraine-pentagon/\">‘Secret’ NATO war plan leak triggers Pentagon probe – NYT</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>The advance will reportedly be aimed at restoring Ukraine’s borders as they were before 2014. This includes the Donetsk and Lugansk People’s Republics and Zaporozhye and Kherson Regions, which all voted to become part of Russia in referendums last autumn, as well as Crimea, which reunited with Moscow nine years ago.</p>\n<p>Former Russian President Dmitry Medvedev, who currently serves as deputy head of the Security Council, previously cast doubt on Ukraine’s ability to carry out such a large-scale operation, arguing that the claims by officials in Kiev were merely<em> “propaganda.” </em></p>\n<p>On Thursday, the New York Times reported that the Pentagon had launched an investigation after a trove of classified data on US and NATO activities to prepare Kiev for a counteroffensive were leaked online. The papers, whose source is unclear, assessed areas such as troop strengths, timelines for arms shipments, and ammunition expenditure. However, they did not state when exactly the operation was scheduled to start.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64302a0885f54021fa5ec592.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 4,
    "title": "Donald Trump’s prosecution has propelled him back into the electoral game",
    "pubDate": "2023-04-07 15:04:09",
    "link": "https://www.rt.com/news/574358-trump-prosecution-president-election/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574358-trump-prosecution-president-election/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > The former president is correct to describe the US as a ‘nation in decline,’ and he is the main symptom of this decline <br><a href=\"https://www.rt.com/news/574358-trump-prosecution-president-election/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The former president is correct to describe the US as a ‘nation in decline,’ and he is the main symptom of this decline</strong></p>\n            \n                        \n            <p>Donald Trump’s 25-minute speech delivered at his Mar-a-Lago compound on Wednesday, following his indictment on felony charges in New York, marks his dramatic return to the center of American politics. </p>\n<p>After languishing in the doldrums for the past few years, Trump is now back in the game with a vengeance – thanks to the decision by New York Attorney General Alvin Bragg to charge him with 34 counts of falsifying business records. Bragg’s controversial decision to prosecute Trump may well turn out to be one of the most consequential misjudgements by a public official in recent American history.</p>\n<p>Trump’s speech on Wednesday was a bravura performance. In apocalyptic tones – <em>“our country is going to hell”</em> – Trump painted a picture of a corrupt, crime-ridden and weak America, foolishly promoting a dangerous and unnecessary conflict in Ukraine, hurtling towards self-destruction. The US, Trump asserted, is a “<em>failing nation … a nation in decline.”</em> </p>\n<p>Trump himself is at the center of this grim prognosis proclaiming himself as the only politician who can “<em>save our country.</em>” In order to prevent this, he claimed, the elites responsible for America’s current state of decline, including the Democrats, the FBI, the Department of Justice, George Soros, Facebook and Twitter, have now conspired to use a corrupt legal system to thwart his reelection. <em>“They can’t beat us at the ballot box so they try and beat us through the law,”</em> he said.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/6429f071203027418b06d273.jpeg\" alt=\"RT\"><figcaption><a href=\"https://www.rt.com/news/574046-trump-triples-lead-desantis-indictment/\">Most Republicans back Trump as 2024 candidate – poll</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>It is hardly surprising that Trump should turn his destructive ire upon the American legal system. He has always held contempt for the rule of law. Who can forget his <a href=\"https://www.cnbc.com/2022/06/24/roe-v-wade-decision-trump-takes-credit-for-supreme-court-abortion-ruling.html\" target=\"_blank\" rel=\"noopener noreferrer\">boasting of having stacked the Supreme Court</a> and his subsequent denunciation of his own appointees when they refused to legally sanction his claim that the 2020 election had been stolen? But in this speech, he went further than he has ever gone before. </p>\n<p>As to the charges brought by Attorney General Bragg, Trump claimed that “<em>there is no case</em>” and that Bragg – who he branded “<em>a criminal”</em> – knew that there was no case. He described the judge presiding over the case as a “<em>Trump hating judge with a Trump hating wife… whose daughter worked for Kamala Harris.</em>” According to the former President, the entire prosecution is something “<em>right out of the old Soviet Union.”</em></p>\n<p>However, Trump’s denunciation of the legal system did not end there. He described the seizure of documents from Mar-a-Lago by the FBI as <em>“illegal”</em> and part of a campaign of <em>“persecution”</em> and <em>“harassment”</em> against him and his family.</p>\n<p>The former president dismissed the investigation into alleged fraudulent practices by Trump’s businesses in New York as <em>“a persecution not an investigation”</em> and accused Attorney General Leticia James of being a “<em>racist in reverse”</em> and a tool of the Democrats.</p>\n<p>Trump went on to describe the Attorney General in Atlanta who is currently investigating him in relation to alleged electoral fraud during the 2020 election as a “<em>racist Democrat Attorney General.”</em></p>\n<p>Bragg’s prosecution, the FBI raid on Mar-a-Lago and the other pending investigations, are, according to Trump, all aspects of a vast legal conspiracy – “<em>our justice system has become lawless</em>” – designed to destroy his prospects of being re-elected President in 2024.</p>\n<p>It is a measure of America’s irreversible decline as a functioning liberal democracy that a person who publicly expresses such views could be a serious candidate for the Presidency. Trump’s encouragement of the January 6 riots and his persistent attempts to overturn the 2020 election result proved that he had absolute contempt for the democratic process. This week’s speech proves that he has a similar contempt for the legal system and rule of law. No previous American president – not even Richard Nixon in his darkest days – would have even thought of behaving in such a manner. </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642c80ec2030274738539c63.jpg\" alt=\"Former US President Donald Trump sits in a New York City courtroom, flanked by his lawyers, as he's arraigned on Tuesday on 34 criminal counts.\"><figcaption><a href=\"https://www.rt.com/news/574188-trump-pleads-not-guilty/\">Trump responds to New York criminal charges</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Two other aspects of Trump’s speech are noteworthy. He repeated his standard critique of Joe Biden and the Democrats as having destroyed America and reduced it to a global laughing stock – focusing on illegal immigration, increasing crime in large cities, inflation and the weakening of the military. He described the Biden family as “<em>criminals and crooks”</em> and made much of Hunter Biden’s various transgressions and the fact that he had not been prosecuted.</p>\n<p>More importantly, Trump strongly criticized America’s involvement in the conflict in Ukraine. He claims the conflict would never have occurred if he had been President, and he asserted that Biden was running the risk of provoking an “<em>all out nuclear war.”</em> He also blamed Biden for having brought about a rapprochement between Russia and China that has weakened America’s position globally.</p>\n<p>There is no doubt that Trump’s prospects of winning the Republican nomination and winning the Presidential election in 2024 have been energized by the Bragg prosecution.</p>\n<p><a href=\"https://docs.cdn.yougov.com/4zul6phwv0/Yahoo_20230331_Toplines_Crosstabs_Joined.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">Polls</a> this week show that Trump has a commanding lead over Ron DeSantis as the preferred Republican Presidential nominee, with other candidates, including Mike Pence and Nikki Haley, having failed to gain virtually any support whatsoever. It is now clear that the primary will be a two-horse race.</p>\n<p>Trump’s lead over DeSantis can be expected to widen, especially if the Bragg prosecution fails. And a bungled prosecution could very well catapult Trump into the White House in 2024.</p>\n<p>It is important to note, that prosecutors must prove that Trump personally falsified various documents with the intention to defraud. Staff who’ve worked with him before say he has an <a href=\"https://time.com/6215419/trump-legal-trouble-key-strategies/\" target=\"_blank\" rel=\"noopener noreferrer\">aversion to putting anything in writing</a>, so proving that he was personally responsible for the falsification of documents, and that he had the requisite intention, will not be an easy task. Many legal experts, including Trump’s opponents, have expressed doubts as to whether Bragg’s prosecution will result in a conviction.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642cdc4f20302748d933b3e8.jpg\" alt=\"Former President Donald Trump speaks at his Mar-a-Lago estate in Palm Beach, Florida, April 4, 2023.\"><figcaption><a href=\"https://www.rt.com/news/574198-trump-speech-charges-arrest/\">Trump condemns arrest in Mar-a-Lago speech</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>It will be interesting to see if Trump seeks to delay the Bragg prosecution or to have it expedited. In either case, he will use the prosecution to turbocharge his campaigns for the Republican nomination and the presidency, and any additional prosecutions that may be brought against him will likely be used to similar effect.</p>\n<p>It is also relevant to note that the Bragg prosecution involves essentially trivial matters. After all, has no American President ever misused campaign funds in the past? This is far less serious, for example, than the alleged electoral fraud in Georgia in which Trump was personally involved, as his infamous telephone conversation with the Georgia Secretary of State shows. Trump would be in far graver difficulties if he had been prosecuted in relation to this matter or his involvement in the January 6 riots.</p>\n<p>It is easy to dismiss the Mar-a-Lago speech as the conspiracy-ridden ravings of a demagogue.  That, however, would be to seriously underestimate Trump’s appeal to a substantial and growing portion of the American electorate – namely all those that have been left behind by globalization. He also personifies many of the grosser aspects of American popular culture, and this makes his political rhetoric extraordinarily effective in contemporary America.</p>\n<p>It must also be conceded that, stripped of its conspiracy theory underpinnings, much of Trump’s critique of Biden and contemporary America is essentially correct – and the fact that Trump is clearly incapable of solving the problems he draws attention to does not invalidate his criticisms. </p>\n<p>This is especially so in relation to Trump’s opposition to Biden’s fervent commitment to perpetuating the conflict in Ukraine. Popular support for Biden’s continued aid to Ukraine is decreasing, and Trump’s promise to end the conflict will no doubt attract large numbers of new voters to his cause. </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642bebaa20302730c46fd0c0.jpg\" alt=\"Former US President Donald Trump waves as he arrives at Trump Tower in New York on April 3, 2023.\"><figcaption><a href=\"https://www.rt.com/news/574128-trump-charges-bumped-felony/\">Charges against Trump ‘bumped up’ – media</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Trump’s energy, belief in his own cause, and campaigning ability stand in stark contrast to Biden – who is becoming progressively more fragile and looks like a doddering politician going through the motions. Anyone who doubts this should compare Trump’s Mar-a-Lago speech with Biden’s unimpressive speech delivered after the recent Nashville school shooting.</p>\n<p>Whatever happens next year, the apparently terminal decline that has beset America in recent decades – so graphically and not inaccurately described by Trump this week – is certain to endure.</p>\n<p>Trump’s continuing attacks on the basic institutions that underlie American liberal democracy will no doubt intensify over the coming months and can only further weaken those already fragile bodies, and his campaign for the presidency will only divide and coarsen American politics and society.</p>\n<p>Donald Trump was correct to describe America as “<em>a nation in decline”</em> this week, but he omitted that the most obvious and egregious symptom of that irreversible decline is none other than Trump himself.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/6430142920302767d864af94.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 5,
    "title": "Taiwan faces choice between ‘peace and war’ – ex-president",
    "pubDate": "2023-04-07 14:54:22",
    "link": "https://www.rt.com/news/574367-asia-china-taiwan-visit/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574367-asia-china-taiwan-visit/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\"  Taiwan’s former leader Ma Ying-jeou makes a historic trip to Beijing and warns of increasing tensions under Taipei’s current leadership <br><a href=\"https://www.rt.com/news/574367-asia-china-taiwan-visit/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>Ma Ying-jeou became the island state’s first-ever former president to visit mainland China</strong></p>\n            \n                        \n            <p>Ma Ying-jeou, president of Taiwan between 2008 and 2016, has warned that the island state might in future be forced to choose between <em>“peace and war”</em> as he criticized Taiwan’s current leadership while concluding an historic visit to China.</p>\n<p><em>“Our administration continues to lead Taiwan to danger,”</em> Ma said on Friday after returning from Shanghai. <em>“The future is a choice between peace and war.”</em> He added that Taiwan and China could potentially share a <em>“common political basis”</em> which would prove to be beneficial to the Taiwanese population.</p>\n<p>Ma led Taiwan for eight years as the head of the Kuomintang (KMT) government, which favors close ties with Beijing, which itself claims sovereignty over the island. He is the first former Taiwanese leader ever to have visited mainland China since civil war fractured the Asian country and prompted the Republic of China government to flee to Taiwan in 1949 after its defeat by Mao Zedong’s Chinese Communist Party.</p>\n<p>Ma’s 12-day trip saw him visit memorial sites and cemeteries, including the tomb of his grandfather in Hunan Province, according to a report by China’s Xinhua News Agency on Friday. It added that the visit <em>“offered a window for compatriots at home and abroad into the kinship of people on both sides of the Taiwan Strait.”</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/643019012030277293782a25.jpg\" alt=\"Taiwan President Tsai Ing-wen, second from left, attends at a Bipartisan Leadership Meeting at the Ronald Reagan Presidential Library in Simi Valley, Calif., Wednesday, April 5, 2023.\"><figcaption><a href=\"https://www.rt.com/news/574357-china-sanctions-us-entities-taiwan/\">China imposes sanctions over US-Taiwan meeting</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>He also said he hoped his coming to China would help ensure <em>“Taiwan has a future of real peace and safety.”</em> </p>\n<p>Taiwan’s current leader, Tsai Ing-wen of the Democratic Progressive Party (DPP), was critical of Ma’s diplomatic venture into China. She said in a statement that it showed he has become an <em>“accomplice”</em> of the One China principle, which advocates a position that Beijing is the legitimate sovereign ruler of Taiwan.</p>\n<p>However, Tsai also indicated that Ma’s cordial visit to Beijing showed that Taiwan and China could in future hold diplomatic discussions to show that both are part of a single China, even if they hold separate definitions of the term.</p>\n<p>Ma’s visit was conducted amid heightened tensions in the Taiwan Strait following a meeting between Tsai and US House Speaker Kevin McCarthy in the USA this week. Earlier this year Tsai proposed renewed talks with Beijing to <em>“maintain stability”</em> in the region. China, which views Tsai as a separatist, suspended cross-strait discussions when she assumed power in 2016.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64302b052030277293782a34.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 6,
    "title": "Saudi Arabia to end Yemen war – media",
    "pubDate": "2023-04-07 14:40:32",
    "link": "https://www.rt.com/news/574369-saudi-arabia-yemen-war-end/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574369-saudi-arabia-yemen-war-end/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > Riyadh intends to declare the eight-year conflict over by the end of Ramadan after talks with the Houthis, multiple sources have said <br><a href=\"https://www.rt.com/news/574369-saudi-arabia-yemen-war-end/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>Hopes abound for a deal on a “permanent ceasefire” with Houthi leaders by the end of April</strong></p>\n            \n                        \n            <p>A delegation representing Saudi Arabia and Oman is due to meet with the Houthi leadership in Sanaa next week to sign a permanent ceasefire ending the eight-year war in Yemen, several outlets have reported, citing officials familiar with the talks.</p>\n<p>Sources told Reuters that an agreement could be announced by April 20, the eve of the Muslim holiday of Eid-al Fitr which marks the end of Ramadan.</p>\n<p>UN Special Envoy for Yemen Hans Grundberg was in Muscat earlier this week, where he met with senior Omani and Houthi officials to discuss the peace process.</p>\n<p>On Thursday, the Saudi-led coalition lifted its naval blockade of Yemen, allowing most ships to dock directly in Aden and other southern ports without stopping in Jeddah for security checks. The blockade was imposed in 2015, when a Saudi-led coalition invaded Yemen on behalf of the government the Houthis had deposed. </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.03/thumbnail/641346a485f5405ed46c2ceb.jpg\" alt=\"FILE PHOTO: Members of the Houthi Ansarullah movement stand outside the governor's residence in Sana'a, Yemen.\"><figcaption><a href=\"https://www.rt.com/news/573095-yemen-peace-saudi-iran/\">Yemen peace talks intensify after Iran-Saudi deal </a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Meanwhile, the Lebanon-based outlet Al-Mayadeen reported that Riyadh had summoned leaders of the Saudi-backed Yemeni government on Friday, to brief them on the talks with the Houthis. Saudi Defense Minister Khalid bin Salman presented <em>“the solution for a way out of the war on Yemen,”</em> the outlet’s sources said.</p>\n<p>According to Al-Mayadeen, the Saudi plan envisions extending the ceasefire by another year, followed by steps to reopen Yemeni ports. Riyadh is then expected to officially announce the end of the war and its intervention in Yemen.</p>\n<p>Saudi Arabia and the UN will subsequently sponsor talks between the Houthis and rival Yemeni factions, seeking a two-year transition period to establish a new government, reports have indicated.</p>\n<p>The diplomatic breakthrough after eight years of fighting was made possible by last month’s agreement between Iran and Saudi Arabia to re-establish diplomatic relations, brokered by China.  </p>\n<p>According to UN estimates, the conflict in Yemen has claimed at least 377,000 lives, of which 150,000 were due to violence and the rest from starvation and disease. Another 4 million people have been displaced.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/64302c7385f5404f2a187fc4.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 7,
    "title": "China imposes sanctions over US-Taiwan meeting",
    "pubDate": "2023-04-07 13:25:05",
    "link": "https://www.rt.com/news/574357-china-sanctions-us-entities-taiwan/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574357-china-sanctions-us-entities-taiwan/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > China has sanctioned several US entities over the meeting between the Taiwanese president and the US House speaker earlier this week <br><a href=\"https://www.rt.com/news/574357-china-sanctions-us-entities-taiwan/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The measures come in response to the encounter between Taipei's leader and the American House speaker</strong></p>\n            \n                        \n            <p>The Chinese government has imposed sanctions on America’s Hudson Institute and Ronald Reagan Presidential Library, as well as executives from the two organizations, after they hosted Taiwan’s president during her recent trip to the US. Beijing has also taken measures against Taiwan’s envoy to Washington.</p>\n<p>The Chinese Foreign Ministry stated that the organizations and individuals were being sanctioned for their roles in the meeting between Taiwanese leader Tsai Ing-wen and US House Speaker Kevin McCarthy earlier this week in California.</p>\n<p>On Friday, the ministry announced that both US institutions are now banned from cooperating with any individuals, universities, or institutions under Beijing’s jurisdiction, including those in Hong Kong and Macau.</p>\n<p>According to the statement, both the Reagan Library and the Hudson Institute – which is a Washington DC-based think tank – had provided a “<em>platform and convenience to Taiwan separatist activities.</em>”</p>\n<p>Several leading executives from the two entities, including Hudson Institute officials Sarah May Stern and John Walters, and Joanne Drake of the Reagan Library, will be denied Chinese visas and will have any assets frozen that they may own in the country.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642ea6b9203027013a42ecdc.jpg\" alt=\"RT\"><figcaption><a href=\"https://www.rt.com/news/574286-us-aircraft-carrier-taiwan-china/\">US and Chinese aircraft carriers deployed near Taiwan – official</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Sanctions were also placed on two more organizations – one from Taiwan and the other from the US – as well as Taipei’s representative in America, Hsiao Bi-khim. Hsiao is already on a Chinese sanctions list for her involvement in the arrangement of the visit by then-US House Speaker Nancy Pelosi to the self-governing island in August of last year.</p>\n<p>On Wednesday, Tsai sat down with McCarthy and a bipartisan group of congressional leaders at the Reagan Library in Simi Valley, California despite China’s stern warnings.</p>\n<p>The Hudson Institute conferred its global leadership award on Taiwan’s president last Thursday.</p>\n<p>During her meeting with McCarthy, Tsai thanked Washington for its commitment to protecting Taiwan’s “<em>way of life,</em>” while the US official stressed the importance of relations between Washington and Taipei.</p>\n<p>Taiwan has been de facto independent since 1949, when the losing side in the Chinese civil war fled to the island and established its own administration. While only a handful of nations have recognized Taiwan as a sovereign state, the US has long maintained close, unofficial ties with Taipei, both militarily and economically. Formally, Washington still professes to adhere to the ‘One-China’ principle.</p>\n<p>Beijing considers the island to be an inalienable part of its territory that has been seized by separatists.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/643019012030277293782a25.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 8,
    "title": "Embracing the empire: What does NATO accession mean for the once famously neutral Finland?",
    "pubDate": "2023-04-07 13:15:25",
    "link": "https://www.rt.com/news/574275-political-death-or-vital-move/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574275-political-death-or-vital-move/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > NATO has expanded once again, extending its border with Russia by almost 1300km. But does Moscow really care? <br><a href=\"https://www.rt.com/news/574275-political-death-or-vital-move/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The US-led NATO military bloc has expanded once again, extending its border with Russia by almost 1300km.</strong></p>\n            \n                        \n            <p>This week, Finland officially became the 31st member state of NATO. Foreign Minister Pekka Haavisto finalized the process by handing over the accession documentation to US Secretary of State Anthony Blinken.</p>\n<p>The move may further aggravate tensions between Russia and the West. Analysts in Moscow argue that Helsinki has undermined its own security in a misguided effort to strengthen it.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642c9cb085f5404c423af0d5.jpg\" alt=\"Finland and NATO flags waving at the Finnish Foreign Ministry in Helsinki on April 04, 2023.\"><figcaption><a href=\"https://www.rt.com/news/574187-finland-nato-international-status/\">New NATO member has lost its ‘special status’ – Moscow</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<h2><strong>A short and winding road</strong></h2>\n<p>Finland has joined the US-led bloc before Sweden, which is something few experts had anticipated. Stockholm is still struggling to gain Turkish approval for its candidature, due to a dispute. Both states applied for membership in May 2022, citing the threat posed by “an aggressive neighbor” after Russia attacked Ukraine.</p>\n<p>NATO did not accept them off the bat, however, despite <a href=\"https://yle.fi/uutiset/3-12268949\" target=\"_blank\" rel=\"noopener noreferrer\">acknowledging</a> their readiness, because of tensions over the support of Kurdish organizations and questions regarding the extradition of individuals charged with terrorism and participation in the 2016 coup attempt in Türkiye.</p>\n<p>Hungary also tried to slow down the process. Prime Minister Viktor Orban <a href=\"https://tass.ru/mezhdunarodnaya-panorama/17134921?ysclid=lg2bp0kp8d695284289\" target=\"_blank\" rel=\"noopener noreferrer\">cited</a> his parliament’s concerns over the move being potentially damaging to NATO-Russia relations.</p>\n<p>For Finland the process eventually took a year. On March 30, the Turkish parliament ratified Helsinki’s accession protocol, and Budapest did the same on March 27. </p>\n    <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/original/642edabc85f5404d025a14d1.jpg\"><figcaption>\n                                    Finnish Foreign Minister Pekka Haavisto, left, shakes hands after handing over his nation's accession document to United States Secretary of State Antony Blinken, right, during a meeting of NATO foreign ministers at NATO headquarters in Brussels, Tuesday, April 4, 2023.\n                \n                <span class=\"copyright\">\n                       ©  Johanna Geron, Pool Photo via AP                                                        </span>\n            </figcaption></figure><h2><strong>What NATO gets</strong></h2>\n<p>As a new NATO member state, Finland is bringing to the table a <a href=\"https://puolustusvoimat.fi/documents/1948673/2014902/CBMFI23.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">mix</a> of advanced Western weapons and last-century Soviet hardware. A big part of the country’s artillery force is comprised of Soviet-made weaponry such as the M46 and 2A36 Giatsint-B field guns and the D30 and 2S1 Gvozdika howitzers. Half of Finland’s grouping of IFVs consists of Swedish CV-9030s, and another half of Soviet BMP-2s.</p>\n<p>Helsinki’s Armed Forces also boast the home-made Patria APC, a modular-design vehicle that can act as a light tank with a large-caliber main gun, or carry a remote-controlled gun and rocket combat module. Poland <a href=\"https://www.rbc.ru/politics/01/04/2023/642801df9a7947a987629151?ysclid=lg2c9q5kom90683836\" target=\"_blank\" rel=\"noopener noreferrer\">imports</a> them under the name of Rosomak. A total of 900 different versions of Patria APCs have been built since 2001. Also, in 2012, Croatia’s Defense Ministry exported 40 to 50 Patria AMV vehicles built under license by national company Duro Dakovic Special Vehicle. In total, Zagreb has purchased 126 Patria AMVs, with six of them built in Finland.</p>\n<p>Finland’s Air Force mostly consists of foreign-made aircraft. According to <a href=\"https://it.insideover.com/difesa/riservisti-e-mezzi-moderni-come-organizzato-lesercito-finlandese.html?utm_source=ilGiornale&amp;utm_medium=article&amp;utm_campaign=article_redirect&amp;_ga=2.204050320.1209689967.1652258806-1270191421.1638868035\" target=\"_blank\" rel=\"noopener noreferrer\">Inside Over</a>, it has 64 American-built F/A-18 Hornet fighters fitted with electronics and control systems mostly made domestically. The fleets service life is expected to expire by 2030, so the country is already looking for upgrades. The current fighters are expected to be replaced with a similar number of fifth-gen F-35A multirole aircraft in a procurement deal already <a href=\"https://valtioneuvosto.fi/en/-/the-lockheed-martin-f-35a-lightning-ii-is-finland-s-next-multi-role-fighter\" target=\"_blank\" rel=\"noopener noreferrer\">announced</a>.</p>\n    <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/original/642ee05c2030271d807b8dc3.jpg\"><figcaption>\n                                    A Finnish Air Forces F/A-18 Hornet fighter gets ready to take off from the E4 Highway in Joutsa, Central Finland during the Baana 2022 training event on September 28, 2022.\n                \n                <span class=\"copyright\">\n                       ©  Markku Ulander / Lehtikuva / AFP                                                        </span>\n            </figcaption></figure><p>Finland’s army operates some 215 Unmanned Aerial Vehicles (UAVs) of different types, nine of which are the MQ-9 Reapers, Inside Over says.</p>\n<p>Mostly focused on coastal operations, the Finnish Navy is trained and armed to protect the country’s territorial waters in the Baltic Sea and quickly strike enemy vessels, to defend transport routes and straits, and to conduct reconnaissance missions, <a href=\"https://russiancouncil.ru/analytics-and-comments/analytics/chem-oboronyaetsya-finlyandiya/?ysclid=lg1vf8xgzs217013654\" target=\"_blank\" rel=\"noopener noreferrer\">says</a> Sergey Andreyev, an expert with the Russian Council on Foreign Affairs. The Finnish Navy has 17 minesweepers of different types and eight high-speed missile boats: four of Hamina-class and four of Rauma-class. </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642d338585f540541c4648b7.jpg\" alt=\"FILE PHOTO: St. Basil's Cathedral, Red Square, Moscow, Russia\"><figcaption><a href=\"https://www.rt.com/russia/574207-can-russia-really-break-away/\">Ivan Timofeev: Can Russia really break away from the West?</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Finland operates German Leopard 2A4 main battle tanks along with some pre-owned Leopard 2A6 tanks <a href=\"https://yle.fi/uutiset/3-7994226\" target=\"_blank\" rel=\"noopener noreferrer\">purchased</a> from the Netherlands in 2015.</p>\n<p>The Finnish Defense Forces have about 21,500 men and women on active duty. The country can also count on some 900,000 reservists who have completed military service.</p>\n<p>However, experts polled by RT believe that NATO’s primary gain in admitting Finland is to expand the bloc’s influence and get closer to Russia’s borders.</p>\n<p><em>“Like any bureaucratic organization, the alliance in this case benefits through expanding its reach and influence. In addition, it is a way of limiting Russia’s influence,”</em> says Director of the Institute of Strategic Assessments Sergey Oznobishchev. </p>\n<p><em>“NATO is trying to keep expanding, seeing Russia as its main adversary. It is getting as close as possible, setting up its infrastructure in the real vicinity of Russia, which is important for NATO and certainly dangerous for Russia,”</em> says Vladimir Bruter, an expert at the International Institute for Humanitarian and Political Studies.</p>\n<p>The head of the Analytical Department at the Institute for Political and Military Analysis (IPWA), Alexander Khramchikhin, takes a different view. According to him, <em>“NATO does not benefit from Finland’s membership. Quite the opposite, it only increases the liabilities for the alliance.”</em></p>\n    <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/original/642ed9bd2030272927252f73.jpg\"><figcaption>\n                                    FILE PHOTO. Picture taken on May 4, 2022 shows Finnish soldiers during the Arrow 22 exercise at the Niinisalo garrison in Kankaanpää, western Finland.\n                \n                <span class=\"copyright\">\n                       ©  Heikki Saukkomaa / Lehtikuva / AFP                                                        </span>\n            </figcaption></figure><h2>What it means for Russia</h2>\n<p>Finland’s accession to NATO will only increase tensions on the global scene, Kremlin spokesman Dmitry Peskov has warned. He described the expansion of the bloc as an encroachment on Russia’s security and national interests. </p>\n<p><em>“That is how we see this development. It forces us to take countermeasures to ensure [Russia’s] security, both tactically and strategically,”</em> Peskov explained.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.03/thumbnail/6425a70d85f54007ad2dfdc4.jpg\" alt=\"Russian servicemen aim a BM-21 Grad multiple launch rocket system at combat positions in the course of Russia's military operation in Ukraine, at the unknown location.\"><figcaption><a href=\"https://www.rt.com/russia/573872-crucial-strategic-choice-in-ukraine/\">Sergey Poletaev: Why the battle for a ‘strategically unimportant’ town may decide the outcome of the Ukraine conflict</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>He pointed out, however, that Russia’s issue with Finland is ‘fundamentally different'’ to the conflict with Kiev and that, unlike Ukraine, the Nordic nation has never been “anti-Russian” or had any disputes with Moscow.</p>\n<p>Nevertheless, in response to Finland joining NATO, Moscow has already vowed to boost its defense capabilities in Russia’s western and northwestern regions. It is not yet clear, however, in what specific form.</p>\n<p><em>“If other NATO members deploy their forces and equipment on Finnish territory, we will take additional steps to ensure Russia’s security,”</em> Deputy Foreign Minister Alexander Grushko warned the day before Helsinki’s accession to the alliance.</p>\n<p>Work is already being done to that end. For example, Defense Minister Sergey Shoigu announced earlier this year that a new army corps will be formed on the border with Finland, in Karelia and the region around St. Petersburg, as part of the effort to bolster Russia’s armed forces in that part of the country. The corps will consist of three motorized rifle divisions and two airborne divisions of the Russian Airborne Forces.</p>\n<p>According to military observer Colonel Mikhail Khodaryonok, Moscow will focus on strengthening ground and coastal troops in the region and expanding the presence of Russian missile troops and artillery.</p>\n<p><em>“It is likely that these new formations will include brigades operating Iskander-M missile systems and heavy artillery brigades carrying nuclear ammunition,”</em> noted Khodaryonok. </p>\n    <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/original/642eda2a20302717893128c3.jpg\"><figcaption>\n                                    A launcher deploys during a special exercise of the Iskander-M tactical missile systems in the Western Military District of Ivanovo Region.\n                \n                <span class=\"copyright\">\n                       ©  Sputnik/Konstantin Morozov                                                        </span>\n            </figcaption></figure><p>According to the expert, should things escalate to a stage where Russia has to plan combat operations in the region, Moscow will most likely consider long-range high-precision strikes on targets in Finland and Sweden, such as can be carried out by long-range aircraft carrying cruise missiles or naval forces carrying Kalibr missiles.</p>\n<p><em>“Given NATO’s superiority in terms of conventional arms, Moscow would do well to consider planting nuclear land mines along the state border with the alliance’s new member states.</em></p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2022.12/thumbnail/63aadc6385f5407f4c77c3fc.jpg\" alt=\"FILE PHOTO.\"><figcaption><a href=\"https://www.rt.com/russia/568940-finland-new-champion-of-russophobia/\">Cold embrace of enmity: How one of Moscow's closest neighbors betrayed its neutrality and national interests to confront Russia</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p><em>“Still, any defensive operation of this scale must be approved first. All military units must be formed, and their deployment planned out. Other workflows to implement include coordination, command and control chains, as well as all kinds of supply routes and military logistics. Naturally, the expenses associated with such an operation would be considerable. But in this case, national defense and security interests clearly take priority,”</em> summarized Khodaryonok.</p>\n<h2>Why Finland wants it</h2>\n<p>Last May, Finland’s then prime minister, Sanna Marin, said in an interview with Corriere della Sera that the question of NATO deploying nuclear weapons or opening bases in Finland was not part of Helsinki’s membership negotiations with the alliance.</p>\n<p><em>“Nobody will come to us to impose nuclear weapons or permanent bases on us if we don't want them. So I think that this topic is not on the agenda,”</em> she said. According to the prime minister, NATO is not interested in stationing its forces or nuclear weapons in Finland.</p>\n<p>Marin emphasized that Finland has invested heavily in its security as <em>“a small country”</em> that <em>“has an aggressive neighbor,”</em> but called the application for NATO membership <em>“an act of peace”</em> rather than war. <em>“It’s about war never returning to Finland,”</em> said Marin, who asserted that Helsinki <em>“will always try to find diplomatic solutions to any problems.”</em></p>\n    <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/original/642eda6f203027293e4a2918.jpg\"><figcaption>\n                                    Finland's Prime Minister Sanna Marin arrives for the first day of a EU leaders Summit at The European Council Building in Brussels on October 20, 2022.\n                \n                <span class=\"copyright\">\n                       ©  Kenzo TRIBOUILLARD / AFP                                                        </span>\n            </figcaption></figure><p>Yet, it is not peace that Helsinki is likely to secure for itself by joining NATO, but the loss of its status and sovereignty, according to military journalist Ivan Konovalov.</p>\n<p>He told RT: <em>“Up to now, Finland enjoyed a very special status of a neutral state on the international scene. Even back in the Cold War times, when the USSR was in a standoff with NATO, the neutral stance made Finland stand out as a player on the global scene, unlike many others. But now it’s over. It’s going to be a political death for Finland that will now become just one of the many nations doing the bidding of Washington. It will lose its political uniqueness and get assimilated by NATO.”</em> </p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642f173b2030271c9f02c301.jpg\" alt=\"RT\"><figcaption><a href=\"https://www.rt.com/sport/574322-world-chess-championship-2023-preview/\">Checkmate: Russian and Chinese stars prepare for tense stand-off in Kazakhstan</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>According to Alexander Khramchikhin, this decision is against Finland’s own interests because it will only undermine the nation’s security, even if Helsinki thinks it’s going to be the other way round. <em>“This has been an irrational decision inspired by fear,”</em> he believes. </p>\n<h2><strong>What’s next?</strong></h2>\n<p>The relationship between Moscow and Helsinki has taken a turn for the worse recently, and as Vladimir Bruter sees it, it’s not going to get any better.</p>\n<p><em>“The only chance to build a balanced relationship is for the West to stop talking about Russia as a force to contain. Russia is either a partner or an adversary. There’s no way for the West to continue containing Russia and maintaining a good relationship with it at the same time. Russia already gave it too much time, despite putting itself at an obvious disadvantage because, as we can see, the West took advantage of this time to keep treating Russia as an economy and a political and military force to contain. I hope Moscow won’t allow that ever again,”</em> Bruter commented.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.03/thumbnail/642033b685f54068f448961c.jpg\" alt=\"RT\"><figcaption><a href=\"https://www.rt.com/africa/573616-cossack-from-djibouti/\">A Cossack from Djibouti: How a Russian con man founded a colony in Africa</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Sergey Oznobishchev believes that although Finland’s accession to NATO is against Russia’s long-term interests, it does not pose any immediate or overwhelming threat. A lot will depend on how well Moscow and Helsinki will work on salvaging the relationship the two nations used to enjoy. According to Oznobishchev, they have a solid foundation to help them with that, i.e. <em>“all those decades of friendship and good neighborly relationship with Helsinki.”</em></p>\n<p><em>“Now is a good time to start working on this,”</em> he argued. <em>“It’s time to focus on stabilizing Russia’s relationship with Finland and Sweden while we have anything that can still be saved. So far these two nations haven’t been overly unfriendly. The matter of essence for Russia is that they don’t let their territories be used by NATO to increase its military presence and to build up military capabilities.”</em></p>\n<p>According to Alexander Khramchikhin, Russia's relations with all Western countries have deteriorated so much that<em> \"the next stage can only be a direct war, which is not likely to happen.\"</em></p>\n<p><em>“I think that we need to continue the endless whining about the restoration of relations with the West. It will never happen, and we need to understand this,” </em>he said.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/642ed8ec85f5404c9b5a33c6.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 9,
    "title": "RT International extends reach via new platforms",
    "pubDate": "2023-04-07 13:15:17",
    "link": "https://www.rt.com/news/574360-rt-international-new-sattelites/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574360-rt-international-new-sattelites/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > RT International has been added to satellite platforms broadcasting predominantly to the Arab world and India <br><a href=\"https://www.rt.com/news/574360-rt-international-new-sattelites/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>The English-language Russian news channel is now available through two more satellites and an Indian TV provider</strong></p>\n            \n                        \n            <p>RT International is now freely available via satellites operated by the Arab Satellite Communications Organization, which is based in Saudi Arabia, and Egypt’s Nilesat. The channel has also been added to India’s DD Free Dish service.</p>\n<p>The Russian news network’s English-language channel is now broadcast by Arabsat’s Badr 4 satellite and the Nilesat 201 satellite. No subscription is required for either service.</p>\n<p>Both transmitters predominantly serve audiences in North Africa and the Arab Peninsula. The Badr 4 signal can also be picked up in numerous European countries, according to its stated coverage. Viewers in some parts of Sub-Saharan Africa can likewise tune in to Badr 4 and Nilesat 201.</p>\n<p>The receiver settings for the two satellites and the list of places where they are available are as follows:</p>\n<p><strong>Badr 4</strong></p>\n<p>Position: 26.0°E <br>Frequency (MHz): 12054 <br>Polarization: V <br>Modulation: DVB-S (QPSK) <br>Symbol Rate (SR): 27500 <br>FEC: 5/6 <br>SID: 1850 <br>VPID: 2140 <br>APID: 2255</p>\n<p>Albania, Algeria, Andorra, Austria, Bahrain, Belgium, Bosnia and Herzegovina, Bulgaria, Croatia, Cyprus, Czech Republic, Denmark, Djibouti, Egypt, Eritrea, Faroe Islands, France, Gaza Strip, Germany, Gibraltar, Greece, Hungary, Iran, Iraq, Ireland, Israel, Italy, Jordan, Kuwait, Lebanon, Libya, Liechtenstein, Luxembourg, Malta, Monaco, Montenegro, Morocco, Netherlands, North Macedonia, Oman, Palestine (PNA), Poland, Portugal, Qatar, Romania, SADR (Western Sahara), San Marino, Saudi Arabia, Serbia, Serbia (Kosovo), Slovakia, Slovenia, Sudan, Sweden, Switzerland, Syria, Tunisia, Türkiye, UAE, United Kingdom, Vatican City, West Bank, Yemen.</p>\n<p><strong>Nilesat 201</strong></p>\n<p>Position: 7.0°W <br>Frequency (MHz): 11958 <br>Polarization: H <br>Modulation: DVB-S (QPSK) <br>Symbol Rate (SR): 27500 <br>FEC: 5/6 <br>SID: 839 <br>VPID: 554 <br>APID: 555</p>\n<p>Algeria, Bahrain, Cyprus, Djibouti, Egypt, Eritrea, Ethiopia, Gaza Strip, Gibraltar, Iraq, Israel, Jordan, Kenya, Kuwait, Lebanon, Libya, Malta, Mauritania, Morocco, Oman, Palestine (PNA), Qatar, SADR (Western Sahara), Saudi Arabia, Somalia, South Sudan, Sudan, Syria, Tunisia, UAE, Uganda (in some parts), West Bank, Yemen.</p>\n<p>Residents of India can now find RT International on the DD Free Dish satellite service operated by state-owned broadcaster Prasar Bharati. The channel was added to its content on April 1.</p>\n<p>The US and its allies have been working for years to reduce RT’s international presence, claiming that the outlet serves as an instrument of Russian propaganda. After the conflict in Ukraine escalated last year, many Western nations demanded that platforms ban RT content from being shown on their territory.</p>\n\n             \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/571111-russian-media-ban-free-speech/\">\n            <span>READ MORE: </span>Ban on Russian media protects ‘freedom of expression’ – Borrell \n        </a>\n    </p>\n\n\n    \n\n<p>RT offers a viewpoint that it believes Western mainstream media outlets fail to present to their audiences, and urges people to <em>“question more”</em> when consuming news. RT programming is available in several languages, including Arabic, English, French, German, Serbian, and Spanish.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/6430137185f540368a43844e.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  },
  {
    "id": 10,
    "title": "Traces of explosives found on Nord Stream sabotage-linked yacht – NYT",
    "pubDate": "2023-04-07 12:51:21",
    "link": "https://www.rt.com/news/574361-nord-stream-sabotage-yacht/?utm_source=rss&utm_medium=rss&utm_campaign=RSS",
    "guid": "https://www.rt.com/news/574361-nord-stream-sabotage-yacht/",
    "author": "RT",
    "thumbnail": "",
    "description": "\n<img alt=\"Preview\" align=\"left\" > German investigators have found traces of explosives on Andromeda, the yacht linked to the Nord Stream sabotage, the New York Times reports <br><a href=\"https://www.rt.com/news/574361-nord-stream-sabotage-yacht/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=RSS\">Read Full Article at RT.com</a>\n",
    "content": "\n<p><strong>Two crew members of the pleasure boat Andromeda had fake passports, according to the outlet</strong></p>\n            \n                        \n            <p>German investigators have discovered traces of explosives on the Andromeda yacht linked to the Nord Stream sabotage last September, the New York Times has reported.</p>\n<p>The information came from three unnamed German officials, the newspaper claimed in an article on Friday.</p>\n<p>The same sources claimed that two out of the six crew members on the <em>“pleasure”</em> boat had used fake Bulgarian passports during the alleged operation against the gas pipelines.</p>\n<p>In early March the Times had reported, citing US officials, that a <em>“pro-Ukrainian group”</em> might’ve been behind the attack that disabled the Nord Stream 1 and 2 pipelines, which were built to deliver Russian gas to Europe via Germany. The paper’s anonymous sources stressed that <em>“no American or British nationals were involved”</em> in the sabotage of the key energy infrastructure.</p>\n<p>The vessel, which had allegedly been rented by the perpetrators to carry out the attack, was soon identified as the yacht Andromeda. The boat is now sitting in dry dock overlooking the Baltic Sea in north-eastern Germany, with<em> “its innards pulled out by investigators,”</em> the NYT said.</p>\n\n            \n    <blockquote>\n        <span><strong>Read more</strong></span>\n        <figure><img src=\"https://mf.b37mrtl.ru/files/2023.04/thumbnail/642eb80885f5405b8e58a684.jpg\" alt=\"FILE PHOTO: A worker at the construction site of the Nord Stream 2 pipeline.\"><figcaption><a href=\"https://www.rt.com/news/574292-nords-stream-state-actor/\">State actor is ‘main scenario’ in Nord Stream sabotage – investigator</a></figcaption></figure>\n</blockquote>\n\n\n    \n\n<p>Kremlin press-secretary Dmitry Peskov suggested earlier that the articles about Andromeda’s involvement were distributed by the Western media in order to divert attention from the report by veteran American investigative journalist Seymour Hersh, which came shortly before the Western media reports and blamed Washington for the sabotage.</p>\n<p>According to an informed source who talked with Hersh, explosives were planted on the pipelines in the Baltic Sea back in June 2022 by US Navy divers during a NATO exercise, and detonated remotely two months later on the order of American leader Joe Biden. The White House has rejected as <em>“utterly false and complete fiction”</em> the findings of the Pulitzer Prize-winning journalist</p>\n<p>In its report on Friday, the NYT also quoted Johannes Riber, a naval officer and analyst at Denmark’s Institute for Strategy and War Studies, who also questioned claims of a 50-foot (15-meter) yacht being capable of carrying out an attack of such scale, likening them to a <em>“James Bond”</em> theory.</p>\n<p>Andromeda could’ve well been a decoy or part of a broader mission, Riber suggested. But planting powerful explosives at the pipelines would’ve likely required an undersea drone or a mini-submarine, and a professional ship to transport it, he pointed out.</p>\n\n             \n    <p>\n        <a target=\"_blank\" href=\"https://www.rt.com/news/574108-nord-stream-investigations-wapo/\">\n            <span>READ MORE: </span>West ‘not so eager to find out’ who bombed Nord Stream – WaPo\n        </a>\n    </p>\n\n\n    \n\n<p>However, the article also contained comments by an unnamed pipeline expert and a professional diver, who both claimed that small bombs could’ve been enough to cripple the infrastructure if they were placed near a seam of the pipeline.</p>\n",
    "enclosure": {
      "link": "https://mf.b37mrtl.ru/files/2023.04/thumbnail/643010d02030273e103e817e.jpg",
      "type": "image/jpeg",
      "length": 123
    },
    "categories": []
  }
]
